[{
          "id": 1,
          "name": "Oak",
          "text": "Oaks have spirally arranged leaves, with lobate margins in many species; some have serrated leaves or entire leaves with smooth margins. Many deciduous species are marcescent, not dropping dead leaves until spring. In spring, a single oak tree produces both male flowers (in the form of catkins) and small female flowers,[4] meaning that the trees are monoecious. The fruit is a nut called an acorn or oak nut borne in a cup-like structure known as a cupule; each acorn contains one seed (rarely two or three) and takes 6–18 months to mature, depending on their species. The acorns and leaves contain tannic acid,[5] which helps to guard from fungi and insects.[6] The live oaks are distinguished for being evergreen, but are not actually a distinct group and instead are dispersed across the genus."
        },
        {
          "id": 2,
          "name": "Birch",
          "text": "Birch species are generally small to medium-sized trees or shrubs, mostly of northern temperate and boreal climates.[4] The simple leaves are alternate, singly or doubly serrate, feather-veined, petiolate and stipulate. They often appear in pairs, but these pairs are really borne on spur-like, two-leaved, lateral branchlets.[5] The fruit is a small samara, although the wings may be obscure in some species. They differ from the alders (Alnus, another genus in the family) in that the female catkins are not woody and disintegrate at maturity, falling apart to release the seeds, unlike the woody, cone-like female alder catkins."
        },
        {
          "id": 3,
          "name": "Wpllows",
          "text": "Willows all have abundant watery bark sap, which is heavily charged with salicylic acid, soft, usually pliant, tough wood, slender branches, and large, fibrous, often stoloniferous roots. The roots are remarkable for their toughness, size, and tenacity to live, and roots readily sprout from aerial parts of the plant.[3]"
        }
      ]